[
    {
        "title": "Portfolio",
        "description": "Created using React, React Router, and TypeScript. This is the site you are currently viewing!",
        "techStack": ["React", "React Router", "Vite", "TypeScript", "Github Actions"],
        "gitLink": "https://github.com/AdamNJG/anjg-portfolio"
    },
    {
        "title": "Basic Reactive Mediator",
         "description": "An open-source TypeScript functional/reactive implementation of the mediator pattern, designed to run as a singleton in either a browser client or a backend server. Built using TDD with mutation tests and simple performance benchmarks, and with zero external dependencies.",
        "techStack": ["TypeScript", "Vitest", "Stryker", "Github Actions", "NPM Publishing"],
        "gitLink": "https://github.com/AdamNJG/basic-reactive-mediator",
        "deployedLink": {
            "link": "https://www.npmjs.com/package/basic-reactive-mediator",
            "displayText": "View on NPM registry"
        } 
    },
    {
        "title": "Basic Swipe Handler",
        "description": "A reusable, framework-agnostic TypeScript library to detect and handle swipe gestures and touch movements on both horizontal and vertical axes. It supports configurable swipe thresholds and callbacks for swipe directions (left, right, up, down), as well as continuous movement updates with minimum and maximum move thresholds. Built with clean API design, strong typing, and performance in mind. Currently a work in progress, with planned enhancements and documentation updates. This was originally created to work with a device that had a touch screen, but no native handling.",
        "techStack": ["TypeScript", "Event Handling", "Custom Gesture Logic", "Vitest"],
        "gitLink": "https://github.com/AdamNJG/basicswipehandler"
    },
    {
        "title": "proto-translator",
        "description": "A high-performance protocol translation layer built in Rust, utilizing a sidecar architecture. Implements a plugin system via FFI and C-header files, allowing native Linux executables to interface with a multi-threaded asynchronous core. Built with Tokio and Axum, it focuses on low-latency data transformation and cross-language compatibility.",
        "techStack": ["Rust", "FFI", "C-Headers", "Multi-threading", "Tokio", "Docker"],
        "gitLink": "https://github.com/AdamNJG/proto-translator"
    },
    {
        "title": "auto-api-gen",
        "description": "A pre-compilation toolchain that transforms API specifications into optimized, type-safe clients. By 'forward caching' the integration logic at build-time, it ensures near-zero runtime overhead and significantly smaller bundle sizes. Designed for maximum execution speed and developer ergonomics by abstracting boilerplate into static, predictable code.",
        "techStack": ["TypeScript", "Compiler Tooling", "Pre-compilation", "Performance Optimization", "DX", "TDD", "Stryker"],
        "gitLink": "https://github.com/AdamNJG/auto-api-gen"
    },
    {
        "title": "Rust OpenGL Engine",
        "description": "A performance-critical rendering engine built from the ground up in Rust. Implements a custom graphics pipeline with a focus on memory safety and zero-cost abstractions. Features manual GPU resource management, abstract buffer handling, and a 'pre-compilation' approach to shader state and pipeline configuration to ensure maximum runtime execution speed. - This is a work in progress and kind of a playground for techniques as I learn them",
        "techStack": ["Rust", "OpenGL", "GLSL", "Linear Algebra", "Systems Programming"],
        "gitLink": "https://github.com/AdamNJG/rust-openGL"
    }
]